src/config/InformationRegisters/Пактум_ДополнительныеСведенияОКонтрагентах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Пактум_ДополнительныеСведенияОКонтрагентах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОтступ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>(Регл) Код по ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства плательщика НДС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяРезидентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФилиала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭДО1СЗвит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПДФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВоенныеСбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКонтактнойИнформации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/CommonModules/Пактум_СерверПереопределяемый/Ext/Module.bsl
Функция СоздатьКонтрагента(ЕДРПОУ, ГруппаКонтрагентов) Экспорт
	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	Если ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда
		НовыйКонтрагент.Родитель = ГруппаКонтрагентов;	
	КонецЕсли;
	НовыйКонтрагент.Наименование = ЕДРПОУ;
	НовыйКонтрагент.КодПоЕДРПОУ = ЕДРПОУ;
	НовыйКонтрагент.Записать();
	
	Возврат НовыйКонтрагент.Ссылка;
КонецФункции

Функция УстановитьРодителяКонтрагента(КонтрагентСсылка, ГруппаКонтрагентов) Экспорт
	Если Не ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда
		Возврат КонтрагентСсылка;	
	КонецЕсли;
	Если КонтрагентСсылка.Родитель = ГруппаКонтрагентов Тогда
		Возврат КонтрагентСсылка;	
	КонецЕсли;
	
	ОбКонтрагент = КонтрагентСсылка.ПолучитьОбъект();
	ОбКонтрагент.Родитель = ГруппаКонтрагентов;
	ОбКонтрагент.Записать();
	
	Возврат ОбКонтрагент.Ссылка;
КонецФункции

Функция ПолучитьДанныеТекущегоКонтрагента(ТекущийКонтрагент) Экспорт
	Стру=Новый Структура;
	Стру.Вставить("ЕДРПОУ", СокрЛП(ТекущийКонтрагент.КодПоЕДРПОУ));
	Стру.Вставить("Код", ТекущийКонтрагент.Код);
	Стру.Вставить("Наименование", ТекущийКонтрагент.Наименование);
	Стру.Вставить("КонтрагентСсылка", ТекущийКонтрагент);
	
	Возврат Стру;
КонецФункции

Процедура ДобавитьРеквизитыПактум(Форма) Экспорт
	МассивРеквизитов = Новый Массив;
	УстановитьПривилегированныйРежим(Истина);
	Настройки=ХранилищеОбщихНастроек.Загрузить("Обработка.Пактум_Контрагент", "Выбранные_Реквизиты", , "Пактум");
	УстановитьПривилегированныйРежим(Ложь);
	Если ТипЗнч(Настройки)=Тип("Массив") Тогда
		МассивРеквизитов = Настройки;
	КонецЕсли;
	Если МассивРеквизитов.Количество() = 0 Тогда
		Форма.Элементы.Пактум_Отчет.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ТабДанные = Пактум_Сервер.ПолучитьДополнительныеСведенияКонтрагента(Форма.Объект.Ссылка);
	Если ТабДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для А = 0 По МассивРеквизитов.Количество() - 1 Цикл
		ТекИД = МассивРеквизитов[А];
		Набор = ТабДанные.НайтиСтроки(Новый Структура("ИД", ТекИД));
		Если Набор.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекСтрока = Набор[0];
		
		ИмяГруппы = "ГруппаПактум_" + А;
		ТекГруппа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"),Форма.Элементы.ГруппаРеквизитыПактумЭлементы);
		ТекГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ТекГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ТекГруппа.ОтображатьЗаголовок = Ложь;
		
		ИмяРеквизита = "Пактум_" + ТекСтрока.ИД;
		Элемент = Форма.Элементы.Добавить(ИмяРеквизита + "_Заголовок", Тип("ДекорацияФормы"), Форма.Элементы[ИмяГруппы]);
		Элемент.Вид = ВидДекорацииФормы.Надпись;                                  
		Элемент.Заголовок = ТекСтрока.Представление + ": ";
		Элемент.Ширина = 14;
	
		Элемент = Форма.Элементы.Добавить(ИмяРеквизита, Тип("ДекорацияФормы"), Форма.Элементы[ИмяГруппы]);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = ТекСтрока.Значение;
		Элемент.Ширина = 76;
		Элемент.Гиперссылка = Истина;
		Элемент.УстановитьДействие("Нажатие", "Пактум_Отчет");	//"ОткрытьРасширенныеДанные");
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРасширенныеДанныеТабличныйДокументСтар(КонтрагентСсылка) Экспорт
	Таб = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.Пактум_ДополнительныеСведенияОКонтрагентах.ПолучитьМакет("Макет");
	тзДопСведения = Пактум_Сервер.ПолучитьДополнительныеСведенияКонтрагента(КонтрагентСсылка);
	Если тзДопСведения.Количество() = 0 Тогда
		Обл = Макет.ПолучитьОбласть("НетДанных");
		Таб.Вывести(Обл);
	Иначе
		Обл = Макет.ПолучитьОбласть("Шапка");
		Набор = тзДопСведения.НайтиСтроки(Новый Структура("ИД", "FullName"));
		Обл.Параметры.ПолноеНаименование = Набор[0].Значение;
		Обл.Параметры.Период = Формат(Набор[0].Период, "ДФ=дд.ММ.гггг");
		Таб.Вывести(Обл);
		Для Каждого Стр Из тзДопСведения Цикл
			Если Стр.ИД = "FullName" Тогда
				Продолжить;
			КонецЕсли;
			Если Не Стр.ОтображатьВОтчете Тогда
				Продолжить;
			КонецЕсли;
			Если Стр.ЕстьОтступ Тогда
				Обл = Макет.ПолучитьОбласть("Отступ");
				Таб.Вывести(Обл);
			КонецЕсли;
			Обл = Макет.ПолучитьОбласть("Строка");
			Обл.Параметры.Представление = Стр.Представление;
			Обл.Параметры.Значение = Стр.Значение;
			Таб.Вывести(Обл);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таб;
КонецФункции

Функция ПолучитьРасширенныеДанныеТабличныйДокумент(КонтрагентСсылка) Экспорт
	Таб = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.Пактум_ДополнительныеСведенияОКонтрагентах.ПолучитьМакет("Макет2");
	тзДопСведения = Пактум_Сервер.ПолучитьДополнительныеСведенияКонтрагента(КонтрагентСсылка);
	Если Не ЗначениеЗаполнено(тзДопСведения) Тогда
		Обл = Макет.ПолучитьОбласть("НетДанных");
		Таб.Вывести(Обл);
	ИначеЕсли тзДопСведения.Количество() = 0 Тогда
		Обл = Макет.ПолучитьОбласть("НетДанных");
		Таб.Вывести(Обл);
	Иначе
		Для Каждого Стр Из тзДопСведения Цикл
			Если ПустаяСтрока(Стр.Представление) И ПустаяСтрока(Стр.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если Стр.ЕстьОтступ Тогда
				Обл = Макет.ПолучитьОбласть("Отступ");
				Таб.Вывести(Обл);
			КонецЕсли;
			Если Стр.Заголовок = 0 Тогда
				Обл = Макет.ПолучитьОбласть("Строка");
				Обл.Параметры.Представление = Стр.Представление;
			ИначеЕсли Стр.Заголовок = 1 Тогда
				Если ПустаяСтрока(Стр.Представление) Тогда
					Обл = Макет.ПолучитьОбласть("Заголовок11");
				Иначе
					Обл = Макет.ПолучитьОбласть("Заголовок1");
					Обл.Параметры.Представление = Стр.Представление;
				КонецЕсли;
			ИначеЕсли Стр.Заголовок = 2 Тогда
				Обл = Макет.ПолучитьОбласть("Заголовок2");
				Обл.Параметры.Представление = Стр.Представление;
			КонецЕсли;
			Обл.Параметры.Значение = Стр.Значение;
			Таб.Вывести(Обл);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таб;
КонецФункции
